In [3]:
#import libraries
import pandas as pd
import sqlite3

In [4]:
#df = pd.DataFrame(#data here :/)

df = pd.DataFrame({'name': ['Juan', 'Victoria', 'Mary'], \
'age': [23, 34, 43], 'city': ['Miami', 'Buenos Aries', 'Santiago']})

In [5]:
df

       name  age          city
0      Juan   23         Miami
1  Victoria   34  Buenos Aries
2      Mary   43      Santiago

In [7]:
#We will sqlite3 library and create a connection
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [11]:
df.to_sql('people', cnn)

In [12]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [15]:
%sql sqlite:///jupyter_sql_tutorial.db

In [17]:
%%sql
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aries'),
 (2, 'Mary', 43, 'Santiago')]

In [18]:
%%sql
SELECT count(*)
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(3,)]

In [19]:
%%sql
SELECT sum(age) as 'age_sum'
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(100,)]

NameError: name 'age_sum' is not defined

In [26]:
stat_handle = input('stat handle:')
stat_sheet = f'./data/{stat_handle}_stats.csv'
csv = pd.read_csv(stat_sheet, sep='\t', header =0, index_col=False)

stat handle:ovechal01

In [30]:
csv[1000:1005]

,date,goals,assists,+/-,pim,shots,shot%,TOI,hits,blocks,faceoff %
1000,2018-04-02,1,0,-2,0,5,20.0,16:56,1.0,1.0,NaN
1001,2018-04-05,1,0,-1,0,4,25.0,21:54,0.0,0.0,NaN
1002,2018-04-07,2,0,1,0,8,25.0,21:00,0.0,1.0,NaN
1003,2018-10-03,1,1,0,0,5,20.0,16:27,0.0,0.0,0.0
1004,2018-10-04,1,0,1,0,3,33.3,20:07,3.0,0.0,NaN